locust/updateCustomer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://customerservice.example.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <cus:updateCustomer>
            <customer>
                <customerId>5</customerId>
                <revenue>9999.0</revenue>
                <name>Judoole</name>
            </customer>
        </cus:updateCustomer>
    </soapenv:Body>
</soapenv:Envelope>